{
    "name": "Tonia Minor",
    "currentJob": "Administrative Assistant at Contractors Asphalt Paving LLC",
    "email": "minor_tonia@yahoo.com",
    "bio": [
        "I am the business owner of Minor Resume Solutions. This means I have the opportunity to be as flexible as my clients need me to be. In addition, I have the satisfaction of helping them aquire that interview they've been trying so hard for through my resume development. I develop attractive and position focused resumes for those who are in search for a career that will change their lives for the better. I also offer customer service throughout the resume writing process."
    ],
    "workExperience": [
        {
            "jobTitle": "Administrative Assistant",
            "organization": "Contractors Asphalt Paving LLC",
            "startDate": "September 2015",
            "endDate": "Present",
            "duration": "1 month",
            "responsibilities": [
                "Preparation of professional proposals for sales people and standard clerical work, such as answering phones, taking messages and filling. Detail oriented, self motivated, organized, and dependable. MS office (Outlook, Word, Excel, PowerPoint). Strong phone communication skills. Able to respond to changing priorities while continuing to maintain attention to details. Type various documents including bids, correspondence, and reports. Filing and maintenance of the office filing system. Handling incoming/outgoing mail and stamping and posting each day. Maintain subcontractors’ insurance certificates file. Maintain inventory of office supplies and ordering such as required. Ensure all office machines are in working order. Maintain business license list/business license applications. Create job folders, directions and entering jobs in the job book. Post jobs to bid on job calendar whiteboard and send a digital reminder to estimators. Assisting estimators with the preparation of bid information for upcoming projects. Run errands as required. Knowledge of creating diagrams/photo editing. Other assignments as required. Type 60 WPM."
            ]
        },
        {
            "jobTitle": "Business Owner",
            "organization": "Minor Resume Solutions",
            "startDate": "August 2015",
            "endDate": "Present",
            "duration": "2 months",
            "responsibilities": [
                "Develop resumes for job seekers: Meet with clients to understand how to tailor the resume best suited for their needs and requests, discuss employment position and goals, create appropriate template for resume, design a resume that will attract employers for that specific career choice, customer service in the evrnt they have questions, modification requestions, or tips for interviewing."
            ]
        },
        {
            "jobTitle": "Independent Business Owner",
            "organization": "Minor Resume Solutions",
            "startDate": "August 2015",
            "endDate": "Present",
            "duration": "2 months",
            "responsibilities": [
                "I have the satisfaction of helping them aquire that interview they've been trying so hard for through my resume development. I develop attractive and position focused resumes for those who are in search for a career that will change their lives for the better. I also offer customer service throughout the resume writing process."
            ]
        },
        {
            "jobTitle": "Administrative Director",
            "organization": "Imperial Senior Suites",
            "startDate": "April 2015",
            "endDate": "August 2015",
            "duration": "5 months",
            "responsibilities": [
                "Greet families and potential tenants; data reconciliation; process forms for accuracy and completeness; use company laptop for word processing; email; and file management; create flyers for company events; operates office equipment; perform research and data gathering activities; answer multi-line telephone; receive and deliver mail; assist in developing and revising procedures, practices, and forms; provide administrative support; and receive, record, process rent payments, and utilize One Site software, track incoming rent/fee payments."
            ]
        },
        {
            "jobTitle": "Youth Specialist",
            "organization": "Oakland County Children's Village",
            "startDate": "September 2013",
            "endDate": "February 2015",
            "duration": "1 year 6 months",
            "responsibilities": [
                "Ensure safety of boys and girls within each assigned building. Log positive and negative behaviors daily. Monitor each residents' duties. Encourage and enforce scheduled events (i.e. school, outdoor time, etc.)."
            ]
        },
        {
            "jobTitle": "Front Desk Administrator",
            "organization": "Auburn Hills Police & Fire Department",
            "startDate": "October 2012",
            "endDate": "September 2013",
            "duration": "1 year",
            "responsibilities": [
                "Address walk-in civil and criminal reports. Direct citizens to appropriate departments. Filing, update paperwork, and light telephone reception."
            ]
        }
    ],
    "unsupported": [
        "Courses",
        "Bachelor of Science, Criminal Justice/Law",
        "Enforcement Administration",
        "University of Phoenix",
        "Teamwork, Collaboration, and Conflict Resolution",
        "SOC/110",
        "Introduction to Effective Written Communication",
        "COMM/105",
        "Essentials of College Writing",
        "COMM/215",
        "Foundations of Criminal Justice",
        "CJA/303",
        "Contemporary Issues in Criminal Justice",
        "CJA/313",
        "Criminology",
        "CJA/323",
        "Policing Theory and Practice",
        "CJA/333",
        "Criminal Law",
        "CJA/343",
        "Criminal Procedure",
        "CJA/353",
        "Interpersonal Communication",
        "CJA/363",
        "Criminal Court Systems",
        "CJA/373",
        "Institutional and Community Corrections",
        "CJA/383",
        "Criminal Organzations",
        "CJA/393",
        "Juvenile Justice Systems and Processes",
        "CJA/403",
        "Research Methods in Criminal Justice",
        "CJA/433",
        "Organizational Behavior and Management",
        "CJA/443",
        "Criminal Justice Administration",
        "CJA/453",
        "Criminal Justice Policy Analysis",
        "CJA/463",
        "Futures of Criminal Justice",
        "CJA/483",
        "Psychology of Personality",
        "PSY/250",
        "Projects",
        "Awards and Certifications",
        "June 1999 to Present",
        "Members:Tonia Minor",
        "Michigan Commission on Law Enforcement Standards: Passed reading and written MCOLES test - B",
        " Band.  University of Phoenix Student Ambassadors - Two Certificates of Appreciation for volunteer",
        " work, community outreach, and membership drives.  U.S. Department of Homeland Security (FEMA) -",
        " Completion of C.B.R.N.E. certification from Center for Domestic Preparedness.  Owen Elementary School",
        " Family - Certificate of Appreciation for parent involvement and volunteer work within the school.  Michigan",
        " State University Extension - Certificate of Recognition for completing the Parenting and Strong Families",
        " course.  Michigan State University Extension - Certificate of Recognition for completing the Food and",
        " Nutrition course.",
        "Organizations",
        "Mason [South] PTA",
        "Volunteer",
        "Understanding the opportunities within the school, district, and community are important to me for the",
        " success of my middle school son. I am choosing to becoming a part of my son's growth, success, and chance",
        " to become his dream. Acknowledging the work that goes into being my son's first teacher and involving",
        " myself in the learning process is important. What better way to show my support than to always make sure",
        " I'm on the same page as my son and offer my help where ever possible. The PTA gives me the support of",
        " other parents and a heads up on what is going on. This means there's no room for naïve representations. My",
        " PTA membership also means that I can offer other parents a different perspective and support where desired. ",
        "University of Phoenix Student Ambassadors",
        "Member",
        "Involved in the research, development, and coordination of community outreach opportunities, alumni events,",
        " and school functions at various locations in metro detroit.",
        "A.J. Stepanski Early Childhood Center PTA",
        " success of my pre-k son. I am choosing to becoming a part of my son's growth, success, and chance to",
        " become his dream. Acknowledging the work that goes into being my son's first teacher and involving myself",
        " in the learning process is important. What better way to show my support than to always make sure I'm on",
        " the same page as my son and offer my help where ever possible. The PTA gives me the support of other",
        " parents and a heads up on what is going on. This means there's no room for naïve representations. My PTA",
        " membership also means that I can offer other parents a different perspective and support where desired.",
        "Honors and Awards",
        "University of Phoenix Student Council - Certificate of Appreciation for volunteer work community outreach",
        " and membership drives.   U.S. Department of Homeland Security (FEMA) - Completion of C.B.R.N.E.",
        " certification from Center for Domestic Preparedness.   Owen Elementary School Family - Certificate of",
        " Appreciation for parent involvement and volunteer work within the school.   Michigan State University",
        " Extension - Certificate of Recognition for completing the Parenting and Strong Families course.   Michigan",
        " State University Extension - Certificate of Recognition for completing the Food and Nutrition course.",
        "Interests",
        "Reading, working out, traveling, museums, festivals, hiking, and the company of close friends and relatives.",
        "Assistant for Alumni Events at University of Phoenix",
        "La'Nelle Jones, Former University of Phoenix Student Ambassador President",
        "July 2012",
        "Received various volunteer awards for devoting time, knowledge, and awareness to student ambassadors, to",
        " University of Phoenix students/alumni, and toward event set up.",
        "Certifications",
        "C.B.R.N.E.",
        "U.S. Department of Homeland Security (FEMA)   License NA    October 2011",
        "MCOLES (written test)",
        "State of Michigan   License NA    November 2012",
        "CPR",
        "American Red Cross   License NA    September 2014 to September 2016",
        "Tonia Minor",
        "Administrative Assistant at Contractors Asphalt Paving LLC",
        "minor_tonia@yahoo.com",
        "1",
        " person has recommended Tonia",
        "\"Tonia Golfin was passionate about her education and will bring significant skills and knowledge to any",
        "organization. She is a proven performer and attained the ability to coach and work with fellow students that",
        "created a stronger bond within her work group. She will continue to be a positive leader within any academic",
        "setting and will encourage her team members to accept ownership and accountability. There is nothing more",
        "critical to her role as a student leader than desire, commitment of heart, mind, and soul.\"",
        "— Chuck Pappas",
        ", Retired Lieutenant, Troy, Michigan Police Department",
        ", taught Tonia at University of",
        "Phoenix"
    ],
    "skills": [
        "Clerical Skills",
        "General Administrative Duties",
        "Telephone Reception",
        "Organizational Structure",
        "Data Entry",
        "Filing",
        "Report Writing",
        "Participant Observation",
        "Non-profit Volunteer",
        "Customer Service",
        "Type 60 WPM",
        "Payroll Services",
        "Conflict Resolution",
        "Account Reconciliation",
        "Quality Auditing",
        "Computer Proficiency",
        "Community Outreach",
        "Fundraising",
        "Leadership",
        "Multi-line Phone",
        "Policy",
        "Receptionist Duties",
        "Typing",
        "Microsoft Word",
        "Microsoft Excel",
        "Time Management",
        "Microsoft Office",
        "Public Speaking",
        "Security",
        "Criminal Justice",
        "Event Planning",
        "Research",
        "Invoicing",
        "Team Leadership",
        "Supervisory Skills",
        "Problem Solving",
        "PowerPoint"
    ],
    "educationExperience": [
        {
            "school": "University of Phoenix",
            "basicInfo": [
                "Criminal Justice/Law Enforcement Administration"
            ],
            "degree": "Bachelor of Science",
            "startDate": "2008",
            "endDate": "2012",
            "grade": "3.23",
            "activitiesAndSocieties": "Through my proven dedication to the Student Alumni, I was assigned to fulfill a Mentor Liasion position for Student Ambassadors by the president of the Student Ambassador organization.1 recommendation available upon request"
        },
        {
            "school": "Waterford Mott High School",
            "basicInfo": [
                "General Education",
                "Core Studies: Math",
                "Social Studies",
                "Science",
                "and Lsnguage Arts"
            ],
            "startDate": "1990",
            "endDate": "1994"
        }
    ],
    "languages": [
        {
            "language": "English",
            "proficiency": "(Full professional proficiency)"
        }
    ],
    "volunteerExperience": [
        {
            "jobTitle": "Front Desk Administrator",
            "organization": "Auburn Hills Police & Fire Department",
            "startDate": "September 2012",
            "endDate": "Present",
            "duration": "3 years 1 month",
            "responsibilities": [
                "I assist in finding solutions for citizens who approach me with an civil, traffic, or criminal issue. I find resources to resolve negative actions against a citizen. I communicate with citizens appropriately to aid in alleviating emotional situations. I direct citizens to dispatchers or the records bureau for accident reports, to retrieve police officer assistance, to obtain personal belongings, for gun registrations, etc. "
            ]
        },
        {
            "jobTitle": "Event Planner",
            "organization": "The Serenity Club",
            "startDate": "March 2011",
            "endDate": "Present",
            "duration": "4 years 7 months",
            "responsibilities": [
                "I assist in the smooth function of the drug and alcohol counseling facility. I ensure all building codes are adhered to. I ensure that all activities and functions are monitored for appropriate use and acceptable behaviors. I ensure the occupants do not excede fire code regulations. I organize parties, stock, budget, and scheduling of events. In addition, I utilize the feedback from our anonymous comment box to apply a better use of our facility and the needs of our struggling and recovering patrons."
            ]
        },
        {
            "jobTitle": "Secretary",
            "organization": "Stepanski E.C.C. Policy Committee",
            "startDate": "September 2012",
            "endDate": "Present",
            "duration": "3 years 1 month",
            "responsibilities": [
                "I take notes during the policy committee meetings. I am a part of the quorum that facilitates the voting allowance for the group who attends the meetings. I help in offering parents special attention in their requests to improve education, curriculum, safety standards, and resources for families in need."
            ]
        }
    ]
}
